Тестовая_база_ERP_14/src/Tasks/РЭЙ_ЗадачиВЭД/РЭЙ_ЗадачиВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>РЭЙ_ЗадачиВЭД</name>
  <addressing>InformationRegister.РЭЙ_РолиИИсполнители</addressing>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.РЭЙ_ВидыЗадачПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗадачи</name>
    <type>
      <types>DocumentRef.РЭЙ_СправкаОВалютныхОперациях</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РЭЙ_СправкаОПодтверждающихДокументах</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСделки</name>
    <type>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСправкиОВалютномКонтроле</name>
    <type>
      <types>EnumRef.РЭЙ_СтатусыСправокВалютногоКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗадачиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеРеквизиты</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РЭЙ_РолиИсполнителей</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

Тестовая_база_ERP_14/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/РЭЙ_СтатусыСправокВалютногоКонтроля/РЭЙ_СтатусыСправокВалютногоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЭЙ_СтатусыСправокВалютногоКонтроля</name>
  <enumValues>
    <name>СправкаПодлежитСозданию</name>
  </enumValues>
  <enumValues>
    <name>СправкаПодлежитСдачеПослезавтра</name>
  </enumValues>
  <enumValues>
    <name>СправкаПодлежитСдачеЗавтра</name>
  </enumValues>
  <enumValues>
    <name>СправкаПодлежитСдачеСегодня</name>
  </enumValues>
  <enumValues>
    <name>СправкаПросрочена</name>
  </enumValues>
  <enumValues>
    <name>СправкаСоздана</name>
  </enumValues>
  <enumValues>
    <name>СправкаРаспечатана</name>
  </enumValues>
  <enumValues>
    <name>СправкаСозданаДокументПерезаписан</name>
  </enumValues>
  <enumValues>
    <name>СправкаРаспечатанаДокументПерезаписан</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/РЭЙ_ЗаявлениеВБанкПС/РЭЙ_ЗаявлениеВБанкПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЭЙ_ЗаявлениеВБанкПС</name>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкНовый</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИногоОснованияЗакрытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыОперацийЗаявлениеВБанк</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияПС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереоформленияПС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияПС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеСуммыКонтракта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаОкончанияНовая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактСуммаНовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЗакрытияПС</name>
    <comment>Номер подпункта Инструкции ЦБ РФ от 16.08.2017 №181-И</comment>
    <type>
      <types>EnumRef.РЭЙ_ОснованияЗакрытияПС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПереоформленияПС</name>
    <comment>Номер подпункта Инструкции ЦБ РФ от 16.08.2017 №181-И</comment>
    <type>
      <types>EnumRef.РЭЙ_ОснованияПереоформленияПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродлениеСрокаКонтракта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктИнструкцииЦБР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонУполномоченногоПС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченныйПС</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПаспортаСделок</name>
    <attributes>
      <name>ПаспортСделки</name>
      <type>
        <types>DocumentRef.РЭЙ_ПаспортСделки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыИныеОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзменениеКодовВидовОпераций</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодВОБанка</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыВалютныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>КодВООрганизации</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыВалютныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_ВидыЗадачПользователей/РЭЙ_ВидыЗадачПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_ВидыЗадачПользователей</name>
  <predefined>
    <items>
      <name>ПаспортСделкиПереоформлениеСрок</name>
      <description>ЗПУК: Переоформление при превышении срока контракта ВЭД</description>
    </items>
    <items>
      <name>ПаспортСделкиПереоформлениеСумма</name>
      <description>ЗПУК: Переоформление при превышении суммы контракта ВЭД</description>
    </items>
    <items>
      <name>КонтрактВЭДПодтверждениеАвтопролонгации</name>
      <description>ЗПУК: Подтверждение автопролонгации контракта ВЭД</description>
    </items>
    <items>
      <name>КонтрактВЭД</name>
      <description>ЗПУК: Создание контракта ВЭД</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствВИностраннойВалюте</name>
      <description>СКВО: Зачисление ДС на валютные счета</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствНаРублевыеСчета</name>
      <description>СКВО: Зачисление ДС на рублевые счета</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствЧерезСчетаЗаРубежом</name>
      <description>СКВО: Зачисление ДС на счета за рубежом</description>
    </items>
    <items>
      <name>ОжидаемыйСрокСВО</name>
      <description>СКВО: Ожидаемый срок</description>
    </items>
    <items>
      <name>СписаниеДенежныхСредствСВалютныхСчетов</name>
      <description>СКВО: Списание ДС с валютных счетов</description>
    </items>
    <items>
      <name>СписаниеДенежныхСредствСРублевыхСчетов</name>
      <description>СКВО: Списание ДС с рублевых счетов</description>
    </items>
    <items>
      <name>СписаниеДенежныхСредствЧерезСчетаЗаРубежом</name>
      <description>СКВО: Списание ДС со счетов за рубежом</description>
    </items>
    <items>
      <name>ОжидаемыйСрокСПД</name>
      <description>СПД:   Ожидаемый срок</description>
    </items>
    <items>
      <name>ПоступлениеДопРасходов</name>
      <description>СПД:   Поступление доп. расходов</description>
    </items>
    <items>
      <name>ПоступлениеТоваровУслуг</name>
      <description>СПД:   Поступление товаров и услуг / ГТД по импорту</description>
    </items>
    <items>
      <name>РеализацияТоваровУслуг</name>
      <description>СПД:   Реализация товаров и услуг</description>
    </items>
  </predefined>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_РолиИсполнителей/РЭЙ_РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_РолиИсполнителей</name>
  <predefined>
    <items>
      <name>РЭЙ_ВалютныйКонтролер</name>
      <description>Валютный контролер</description>
    </items>
    <items>
      <name>Юрист</name>
      <description>Юрист</description>
    </items>
  </predefined>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Tasks/РЭЙ_ЗадачиВЭД/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытий_Форма

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнформерКурсыВалют();
	ЗаполнитьТекущегоПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "РЭЙ_ОбновитьФормуЗадач" Тогда
		ОбновитьФорму();
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_Список	

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ДоступностьКнопкиПечати();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд_Список	

&НаКлиенте
Процедура КомандаВосстановить(Команда)
	СписокЗадач = ПолучитьСписокВыполненныхЗадачПоВЭД();

	ВыбрЗадача = Неопределено;
	СписокЗадач.ОтметитьЭлементы("Выберите выполненные задачи для восстановления"); 
	
	КомандаВосстановитьНаСервере(СписокЗадач);
	
	ОбновитьФорму();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомандаВосстановитьНаСервере(СписокЗадач)
	Для Каждого Элемент из СписокЗадач Цикл
        Если Элемент.Пометка Тогда
           	ДокОсн = Элемент.Значение.ОбъектЗадачи;
			РЭЙ_ЗадачиСервер.СнятьПризнакЗадачаВыполнена(ДокОсн);
        КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаВыполнитьЗадачу(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РЭЙ_СлужебныйКлиент.ВыполнитьЗадачу(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписокЗадач(Команда)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтключитьОтбор(Команда)
	ОчиститьОтбор();
	Элементы.КомандаОтключитьОтбор.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьДляПечати(Команда)
	ДанныеСтроки = Элементы.Список.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъектПечати = ПолучитьСсылкуНаОбъектПечати(ДанныеСтроки.Ссылка);
	
	Если СсылкаНаОбъектПечати <> Неопределено Тогда 
		ПоказатьЗначение(, СсылкаНаОбъектПечати);
	Иначе 
		ПоказатьПредупреждение(, "По данному документу справка еще не создана.");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЗадачу(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПоказатьЗначение(, ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьЗадачу(Команда)
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат
	ИначеЕсли Элементы.Список.ВыделенныеСтроки.Количество() = 1 Тогда
		ТекстВопроса = "Отменить задачу?";
	ИначеЕсли Элементы.Список.ВыделенныеСтроки.Количество() > 1 Тогда
		ТекстВопроса = "Отменить задачи?";
	КонецЕсли;
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("КомандаОтменитьЗадачу_Продолжение", ЭтотОбъект, Новый Структура("НомерСтроки", 0));
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьЗадачу_Продолжение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		текНомерСтроки = ДополнительныеПараметры.НомерСтроки;
		текСтрока = Элементы.Список.ДанныеСтроки(Элементы.Список.ВыделенныеСтроки[текНомерСтроки]);
		КомандаОтменитьЗадачуНаСервере(текСтрока.Ссылка);
		
		текНомерСтроки = текНомерСтроки + 1;
		Если текНомерСтроки < Элементы.Список.ВыделенныеСтроки.Количество() Тогда
			КомандаОтменитьЗадачу_Продолжение(Результат, Новый Структура("НомерСтроки", текНомерСтроки));
		Иначе
			НадписьОбщееКоличествоЗадачПоВЭД = Строка(ПолучитьОбщееКоличествоЗадачПоВЭД());
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомандаОтменитьЗадачуНаСервере(текЗадача)
	НачатьТранзакцию();
	
	ЗадачаОбъект = текЗадача.ПолучитьОбъект();	
	ЗадачаОбъект.Выполнена = Истина;
	ЗадачаОбъект.Записать();
	
	Если ЗадачаОбъект.ВидЗадачи = Справочники.РЭЙ_ВидыЗадачПользователей.КонтрактВЭДПодтверждениеАвтопролонгации Тогда
		КонтрактВЭД_Объект = текЗадача.ОбъектЗадачи.ПолучитьОбъект();
		КонтрактВЭД_Объект.Автопролонгация = Ложь;
		КонтрактВЭД_Объект.Записать();
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры	

&НаКлиенте
Процедура КомандаУдалитьЗадачу(Команда)
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат
	ИначеЕсли Элементы.Список.ВыделенныеСтроки.Количество() = 1 Тогда
		ТекстВопроса = "Удалить элемент?";
	ИначеЕсли Элементы.Список.ВыделенныеСтроки.Количество() > 1 Тогда
		ТекстВопроса = "Удалить элементы?";
	КонецЕсли;
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("КомандаУдалитьЗадачу_Продолжение1", ЭтотОбъект, Новый Структура("НомерСтроки", 0));
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьЗадачу_Продолжение1(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		текНомерСтроки = ДополнительныеПараметры.НомерСтроки;
		текСтрока = Элементы.Список.ДанныеСтроки(Элементы.Список.ВыделенныеСтроки[текНомерСтроки]);
		Если текСтрока.ВидЗадачи = ПредопределенноеЗначение("Справочник.РЭЙ_ВидыЗадачПользователей.ПаспортСделкиПереоформлениеСрок") Тогда
			ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("КомандаУдалитьЗадачу_Продолжение2", ЭтотОбъект, Новый Структура("НомерСтроки", текНомерСтроки));
			ТекстВопроса = "Сделать контракт " + текСтрока.КонтрактВЭД + " не действующим?";
			ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Иначе
			КомандаУдалитьЗадачуНаСервере(текСтрока.Ссылка);
			
			текНомерСтроки = текНомерСтроки + 1;
			Если текНомерСтроки < Элементы.Список.ВыделенныеСтроки.Количество() Тогда
				КомандаУдалитьЗадачу_Продолжение1(Результат, Новый Структура("НомерСтроки", текНомерСтроки));
			Иначе
				НадписьОбщееКоличествоЗадачПоВЭД = Строка(ПолучитьОбщееКоличествоЗадачПоВЭД());
				Элементы.Список.Обновить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьЗадачу_Продолжение2(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе
		текНомерСтроки = ДополнительныеПараметры.НомерСтроки;
		текСтрока = Элементы.Список.ДанныеСтроки(Элементы.Список.ВыделенныеСтроки[текНомерСтроки]);
		Если Результат = КодВозвратаДиалога.Да Тогда
			СделатьКонтрактНедействующим(текСтрока.КонтрактВЭД);
		КонецЕсли;
		КомандаУдалитьЗадачуНаСервере(текСтрока.Ссылка);
		
		текНомерСтроки = текНомерСтроки + 1;
		Если текНомерСтроки < Элементы.Список.ВыделенныеСтроки.Количество() Тогда
			КомандаУдалитьЗадачу_Продолжение1(Результат, Новый Структура("НомерСтроки", текНомерСтроки));
		Иначе
			НадписьОбщееКоличествоЗадачПоВЭД = Строка(ПолучитьОбщееКоличествоЗадачПоВЭД());
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомандаУдалитьЗадачуНаСервере(текЗадача)
	ЗадачаОбъект = текЗадача.ПолучитьОбъект();	
	ЗадачаОбъект.Удалить();
КонецПроцедуры	

&НаКлиенте
Процедура КомандаУстановитьОтбор(Команда)
	ПараметрыОтркытия = Новый Структура;
	ПараметрыОтркытия.Вставить("АдресТаблицыНастроекОтбора", АдресТаблицыНастроекОтбора); 	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьОтбор_Завершение", ЭтотОбъект);
	ОткрытьФорму("Задача.РЭЙ_ЗадачиВЭД.Форма.НастройкаОтбора", ПараметрыОтркытия,,,,, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьОтбор_Завершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		
		ОчиститьОтбор();
		
		Если Результат.ОтборыУстановлены Тогда
			
			ЭлементыОтбора = Список.Отбор.Элементы;
			
			ПолеКомпоновкиДанныхСсылка = Новый ПолеКомпоновкиДанных("Ссылка");
			
			БылОтборПоСсылке = Ложь;
			
			Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
				
				Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДанныхСсылка Тогда
					
					ЭлементОтбора.ЛевоеЗначение	= Результат.Ссылки;
					
					ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Организация");
					ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
					ЭлементОтбора.ПравоеЗначение 	= Результат.Ссылки;
					ЭлементОтбора.Использование		= Истина;
					
					БылОтборПоСсылке = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не БылОтборПоСсылке Тогда
				
				ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение		= ПолеКомпоновкиДанныхСсылка;
				ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлементОтбора.ПравоеЗначение	= Результат.Ссылки;
				ЭлементОтбора.Использование		= Истина;
				
			КонецЕсли;	
			
			АдресТаблицыНастроекОтбора = Результат.АдресТаблицыНастроекОтбора;
			
		КонецЕсли;
		
		Элементы.КомандаОтключитьОтбор.Доступность	= Результат.ОтборыУстановлены;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДоступностьКнопкиПечати()
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные.СтатусСправкиОВалютномКонтроле = ПредопределенноеЗначение("Перечисление.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаСоздана") Или
		ТекущиеДанные.СтатусСправкиОВалютномКонтроле = ПредопределенноеЗначение("Перечисление.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаРаспечатана") Или	
		ТекущиеДанные.СтатусСправкиОВалютномКонтроле = ПредопределенноеЗначение("Перечисление.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаСозданаДокументПерезаписан") Или	
		ТекущиеДанные.СтатусСправкиОВалютномКонтроле = ПредопределенноеЗначение("Перечисление.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаРаспечатанаДокументПерезаписан") Тогда	
		
		Элементы.СписокКонтекстноеМенюКомандаОткрытьДляПечати.Доступность = Истина;
	Иначе
		Элементы.СписокКонтекстноеМенюКомандаОткрытьДляПечати.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТекущегоПользователя()
	Исполнитель	= ПараметрыСеанса.ТекущийПользователь;
	
	Если СокрЛП(Исполнитель.Код) = "<Не указан>" Тогда
		НадписьТекущийПользователь = "Задачи";
	Иначе
		НадписьТекущийПользователь = "Задачи (" + ПредставлениеРаботника(Строка(Исполнитель))+ ")";
		НадписьОбщееКоличествоЗадачПоВЭД = Строка(ПолучитьОбщееКоличествоЗадачПоВЭД());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИнформерКурсыВалют()
	
	Запрос = Новый Запрос;
	
	СсылкаЕвро = Справочники.Валюты.ПустаяСсылка();
	СсылкаДолл = Справочники.Валюты.ПустаяСсылка();
	
	СсылкаЕвро = Справочники.Валюты.НайтиПоКоду("978");
	СсылкаДолл = Справочники.Валюты.НайтиПоКоду("840");
	
	ИнфоСтрока = "";
	ДатаКурса = Дата(1,1,1);
	
	Если ЗначениеЗаполнено(СсылкаДолл) Тогда
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |		КурсыВалют.Период КАК Период,
		               |		КурсыВалют.Валюта КАК Валюта,
		               |		КурсыВалют.Курс КАК Курс,
		               |		КурсыВалют.Кратность КАК Кратность
		               |	ИЗ
		               |		РегистрСведений.КурсыВалют КАК КурсыВалют
		               |	ГДЕ
		               |		КурсыВалют.Валюта = &СсылкаВалюта
		               |	
		               |	УПОРЯДОЧИТЬ ПО
		               |		Период УБЫВ";
		
		Запрос.УстановитьПараметр("СсылкаВалюта", СсылкаДолл);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если Выборка.Количество()>0 Тогда
			ИнфоСтрока = ИнфоСтрока +
						?(ПустаяСтрока(ИнфоСтрока), "", "  ") +
						Выборка.Валюта.Наименование + " " + Формат(Выборка.Курс, "ЧДЦ=4; ЧРД=.") ;
						
			ДатаКурса = Макс(ДатаКурса, Выборка.Период);
		КонецЕсли;
	КонецЕсли;	
	Если ЗначениеЗаполнено(СсылкаЕвро) Тогда
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |		КурсыВалют.Период КАК Период,
		               |		КурсыВалют.Валюта КАК Валюта,
		               |		КурсыВалют.Курс КАК Курс,
		               |		КурсыВалют.Кратность КАК Кратность
		               |	ИЗ
		               |		РегистрСведений.КурсыВалют КАК КурсыВалют
		               |	ГДЕ
		               |		КурсыВалют.Валюта = &СсылкаВалюта
		               |	
		               |	УПОРЯДОЧИТЬ ПО
		               |		Период УБЫВ";
		
		Запрос.УстановитьПараметр("СсылкаВалюта", СсылкаЕвро);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если Выборка.Количество()>0 Тогда
			ИнфоСтрока = ИнфоСтрока +
						?(ПустаяСтрока(ИнфоСтрока), "", "  ") +
						Выборка.Валюта.Наименование + " " + Формат(Выборка.Курс, "ЧДЦ=4; ЧРД=.") ;
						
			ДатаКурса = Макс(ДатаКурса, Выборка.Период);
		КонецЕсли;
	КонецЕсли;
	
	НадписьКурсыВалют = Формат(ДатаКурса, "ДФ=dd.MM.yyyy") + "    " + ИнфоСтрока;
	ИсходнаяНадписьКурсыВалют = НадписьКурсыВалют;
	
		
	ЦветТекста = ПолучитьЦветТекстСообщенияИнформации();
	
	Элементы.НадписьКурсыВалют.ЦветТекста = ЦветТекста;
	Элементы.НадписьОбщееКоличествоЗадачПоВЭД.ЦветТекста = ЦветТекста;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	ОбновитьФормуНаСервере();	
	ДоступностьКнопкиПечати();
КонецПроцедуры	

&НаСервере
Процедура ОбновитьФормуНаСервере()
	РЭЙ_ЗадачиСервер.КонтрольДатыИсполненияЗадачи();
	НадписьОбщееКоличествоЗадачПоВЭД = Строка(ПолучитьОбщееКоличествоЗадачПоВЭД());
	
	Элементы.Список.Обновить();
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьОтбор()
	Список.Отбор.Элементы.Очистить();
	АдресТаблицыНастроекОтбора = "";
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура СделатьКонтрактНедействующим(текКонтрактВЭД)
	КонтрактОбъект = текКонтрактВЭД.ПолучитьОбъект();
	КонтрактОбъект.НеДействует = Истина;
	КонтрактОбъект.Записать();
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьОбщееКоличествоЗадачПоВЭД()
	СписокРолей = Новый СписокЗначений;
	Если РольДоступна("РЭЙ_ВалютныйКонтролер") Тогда
		СписокРолей.Добавить(Справочники.РЭЙ_РолиИсполнителей.РЭЙ_ВалютныйКонтролер);
	КонецЕсли;
	Если РольДоступна("РЭЙ_ЮристПоВЭД") Тогда
		СписокРолей.Добавить(Справочники.РЭЙ_РолиИсполнителей.Юрист);
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Выполнена", Ложь);
	Запрос.УстановитьПараметр("Роль", СписокРолей);
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Роль", СписокРолей);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Задачи.Ссылка), 0) КАК КоличествоЗадач
	|ИЗ
	|	Задача.РЭЙ_ЗадачиВЭД КАК Задачи
	|ГДЕ
	|	Задачи.Выполнена = ЛОЖЬ
	|	И Задачи.Роль В(&Роль)";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КоличествоЗадач;
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьСписокВыполненныхЗадачПоВЭД()
	Перем СписокВыбора;
	Перем Запрос;
	
	СписокВыбора = Новый СписокЗначений; 
	
	
	Запрос = Новый Запрос;	
	
	Запрос.УстановитьПараметр("Выполнена",	Истина);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Ссылка
	|ИЗ
	|	Задача.РЭЙ_ЗадачиВЭД КАК Задачи
	|ГДЕ
	|	Задачи.Выполнена = &Выполнена 
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка,Выборка.Ссылка.Наименование);
	КонецЦикла;
	
	Возврат СписокВыбора;
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаОбъектПечати(Ссылка)
	СсылаНаОбъектПечати	= Неопределено;
	
	ОбъектЗадачи = Ссылка.ОбъектЗадачи;
	
	Если ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.РЭЙ_КонтрактыВЭД") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РЭЙ_ПаспортСделки.Ссылка
		|ИЗ
		|	Документ.РЭЙ_ПаспортСделки КАК РЭЙ_ПаспортСделки
		|ГДЕ
		|	РЭЙ_ПаспортСделки.КонтрактВЭД = &КонтрактВЭД
		|	И РЭЙ_ПаспортСделки.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РЭЙ_ПаспортСделки.Дата УБЫВ";
		Запрос.УстановитьПараметр("КонтрактВЭД", ОбъектЗадачи);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СсылаНаОбъектПечати	= Выборка.Ссылка;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.РЭЙ_ПаспортСделки") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка
		|ИЗ
		|	Документ.РЭЙ_ЗаявлениеВБанкПС.ПаспортаСделок КАК РЭЙ_ЗаявлениеВБанкПСПаспортаСделок
		|ГДЕ
		|	РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.ПаспортСделки = &ПаспортСделки
		|	И РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РЭЙ_ЗаявлениеВБанкПСПаспортаСделок.Ссылка.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("ПаспортСделки", ОбъектЗадачи);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СсылаНаОбъектПечати	= Выборка.Ссылка;
		КонецЕсли;
	Иначе
		
		ВидДокумента = ВРег(СокрЛП(ОбъектЗадачи.Метаданные().Имя));
		
		ТаблицаВидовРасчетныхДокументов = РЭЙ_СлужебныйСервер.ПолучитьТаблицуРасчетныхДокументов();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Документ", ОбъектЗадачи);
		
		Если ТаблицаВидовРасчетныхДокументов.Найти(ВидДокумента, "ВидВРег") <> Неопределено Тогда
			// СВО
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СВО.Ссылка
			|ИЗ
			|	Документ.РЭЙ_СправкаОВалютныхОперациях.ВалютныеОперации КАК СВО
			|ГДЕ
			|	СВО.Ссылка.ПометкаУдаления = ЛОЖЬ
			|	И СВО.РасчетныйДокумент = &Документ
			|
			|УПОРЯДОЧИТЬ ПО
			|	СВО.Ссылка.Дата УБЫВ";
			Выборка = Запрос.Выполнить().Выбрать();
		Иначе
			// СПД
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СПД.Ссылка
			|ИЗ
			|	Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы КАК СПД
			|ГДЕ
			|	СПД.Ссылка.ПометкаУдаления = ЛОЖЬ
			|	И СПД.Документ В (&Документ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	СПД.Ссылка.Дата УБЫВ";
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Количество() = 0 Тогда
				Если ВРег(ОбъектЗадачи.Метаданные().Имя) = ВРег("ГТДИмпорт") Тогда
					ЗапросГТД = Новый Запрос;
					ЗапросГТД.Текст =
					"ВЫБРАТЬ
					|	ГТДИмпортТовары.ДокументПартии
					|ИЗ
					|	Документ.ГТДИмпорт.Товары КАК ГТДИмпортТовары
					|ГДЕ
					|	ГТДИмпортТовары.Ссылка = &Документ";
					
					ЗапросГТД.УстановитьПараметр("Документ", ОбъектЗадачи);
					
					РезультатЗапросаГТД = ЗапросГТД.Выполнить();
					
					Если Не РезультатЗапросаГТД.Пустой() Тогда
						Запрос.УстановитьПараметр("Документ", РезультатЗапросаГТД.Выгрузить().ВыгрузитьКолонку("ДокументПартии"));
						Выборка = Запрос.Выполнить().Выбрать();
					КонецЕсли;
				КонецЕсли;
				Если ВРег(ОбъектЗадачи.Метаданные().Имя) = ВРег("ТаможеннаяДекларацияИмпорт") Тогда
					ЗапросГТД = Новый Запрос;
					ЗапросГТД.Текст =
					"ВЫБРАТЬ
					|	ГТДИмпортТовары.ДокументПоступления
					|ИЗ
					|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ГТДИмпортТовары
					|ГДЕ
					|	ГТДИмпортТовары.Ссылка = &Документ";
					
					ЗапросГТД.УстановитьПараметр("Документ", ОбъектЗадачи);
					
					РезультатЗапросаГТД = ЗапросГТД.Выполнить();
					
					Если Не РезультатЗапросаГТД.Пустой() Тогда
						Запрос.УстановитьПараметр("Документ", РезультатЗапросаГТД.Выгрузить().ВыгрузитьКолонку("ДокументПоступления"));
						Выборка = Запрос.Выполнить().Выбрать();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.Следующий() Тогда
			СсылаНаОбъектПечати	= Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СсылаНаОбъектПечати;
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьЦветТекстСообщенияИнформации()
	ИмяЭлементаСтиля = "ЦветЗаголовкаИнформационнойПанели";
	Если Метаданные.ЭлементыСтиля.Найти(ИмяЭлементаСтиля) <> Неопределено Тогда
		Возврат ЦветаСтиля[ИмяЭлементаСтиля];
	Иначе
		Возврат Новый Цвет(0, 150, 70);
	КонецЕсли;
КонецФункции	

&НаСервере
Функция ПредставлениеРаботника(Работник, Знач Падеж = 1, Знач Пол = Неопределено)
	ТипДанных = ТипЗнч(Работник);
	Если ТипДанных = Тип("Строка") Тогда
		РаботникФИО = Работник;
		РаботникПол = Пол;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Работник", Работник);
		Если ТипДанных = Тип("СправочникСсылка.Сотрудники") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Наименование,
			|	СотрудникиОрганизаций.ФизическоеЛицо.Пол КАК Пол
			|ИЗ
			|	Справочник.Сотрудники КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка = &Работник";
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.Наименование,
			|	ФизическиеЛица.Пол
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Ссылка = &Работник";
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			РаботникФИО = Выборка.Наименование;
			РаботникПол = Выборка.Пол;
		Иначе
			Возврат ""
		КонецЕсли;
	КонецЕсли;
	
	ФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(РаботникФИО);
	
	ПозицияПервогоПробела = Найти(ФИО + " "," ");
	Фамилия  = Лев(ФИО,ПозицияПервогоПробела-1);
	Инициалы = Сред(ФИО,ПозицияПервогоПробела+1);
	
	РезультатСклонения = "";
	ФИО = Фамилия + " " + Инициалы;	
	
	Возврат ФИО
КонецФункции

#КонецОбласти
